seichris/codex-esp32-display/firmware/sdkconfig.defaults
# Waveshare official LVGL-example baseline: conservative 16 MB map on 32 MB flash, 8 MB OPI PSRAM
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# Keep general-purpose LVGL allocations in PSRAM so internal RAM remains
# available for the display driver's DMA staging buffers.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
# Keep each partial QSPI flush small enough for the internal DMA staging pool.
CONFIG_BSP_DISPLAY_LVGL_BUF_HEIGHT=20
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"

CONFIG_CODEX_ATTENTION_WIFI_SSID="CHANGE_ME"
CONFIG_CODEX_ATTENTION_WIFI_PASSWORD=""
CONFIG_CODEX_ATTENTION_BRIDGE_URL="http://192.168.1.2:5180/api/v1/attention"
CONFIG_CODEX_ATTENTION_BRIDGE_TOKEN=""
CONFIG_CODEX_ATTENTION_POLL_INTERVAL_MS=2000
CONFIG_CODEX_ATTENTION_MAX_ITEMS=20
